xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxMtu_reg.h
/** \brief 5C0, Read Data and Bit Flip Register 48 */
#define MTU_MC5_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615C0u)

/** \brief 5C2, Read Data and Bit Flip Register 49 */
#define MTU_MC5_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615C2u)

/** \brief 5C4, Read Data and Bit Flip Register 50 */
#define MTU_MC5_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615C4u)

/** \brief 5C6, Read Data and Bit Flip Register 51 */
#define MTU_MC5_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615C6u)

/** \brief 5C8, Read Data and Bit Flip Register 52 */
#define MTU_MC5_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615C8u)

/** \brief 5CA, Read Data and Bit Flip Register 53 */
#define MTU_MC5_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615CAu)

/** \brief 5CC, Read Data and Bit Flip Register 54 */
#define MTU_MC5_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615CCu)

/** \brief 5CE, Read Data and Bit Flip Register 55 */
#define MTU_MC5_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615CEu)

/** \brief 5D0, Read Data and Bit Flip Register 56 */
#define MTU_MC5_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615D0u)

/** \brief 5D2, Read Data and Bit Flip Register 57 */
#define MTU_MC5_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615D2u)

/** \brief 5D4, Read Data and Bit Flip Register 58 */
#define MTU_MC5_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615D4u)

/** \brief 5D6, Read Data and Bit Flip Register 59 */
#define MTU_MC5_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615D6u)

/** \brief 5D8, Read Data and Bit Flip Register 60 */
#define MTU_MC5_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615D8u)

/** \brief 5DA, Read Data and Bit Flip Register 61 */
#define MTU_MC5_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615DAu)

/** \brief 5DC, Read Data and Bit Flip Register 62 */
#define MTU_MC5_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615DCu)

/** \brief 5DE, Read Data and Bit Flip Register 63 */
#define MTU_MC5_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615DEu)

/** \brief 5E0, Read Data and Bit Flip Register 64 */
#define MTU_MC5_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615E0u)

/** \brief 5E2, Read Data and Bit Flip Register 65 */
#define MTU_MC5_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615E2u)

/** \brief 5E4, Read Data and Bit Flip Register 66 */
#define MTU_MC5_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615E4u)

/** \brief 5EE, Alarm Sources Configuration Register */
#define MTU_MC5_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00615EEu)

/** \brief 5F0, SSH Safety Faults Status Register  */
#define MTU_MC5_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00615F0u)

/** \brief 5F2, Error Information Register 0 */
#define MTU_MC5_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00615F2u)

/** \brief 5F4, Error Information Register 1 */
#define MTU_MC5_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00615F4u)

/** \brief 5F6, Error Information Register 2 */
#define MTU_MC5_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00615F6u)

/** \brief 5F8, Error Information Register 3 */
#define MTU_MC5_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00615F8u)

/** \brief 5FA, Error Information Register 4 */
#define MTU_MC5_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00615FAu)

/** \brief 600, Configuration Registers */
#define MTU_MC6_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061600u)

/** \brief 602, Configuration Register 1 */
#define MTU_MC6_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061602u)

/** \brief 604, MBIST Control Register */
#define MTU_MC6_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061604u)

/** \brief 606, Status Register */
#define MTU_MC6_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061606u)

/** \brief 608, Range Register, single address mode */
#define MTU_MC6_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061608u)

/** \brief 60C, Revision ID Register */
#define MTU_MC6_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006160Cu)

/** \brief 60E, ECC Safety Register */
#define MTU_MC6_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006160Eu)

/** \brief 610, Memory ECC Detection Register */
#define MTU_MC6_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061610u)

/** \brief 612, Error Tracking Register 0 */
#define MTU_MC6_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061612u)

/** \brief 614, Error Tracking Register 1 */
#define MTU_MC6_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061614u)

/** \brief 616, Error Tracking Register 2 */
#define MTU_MC6_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061616u)

/** \brief 618, Error Tracking Register 3 */
#define MTU_MC6_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061618u)

/** \brief 61A, Error Tracking Register 4 */
#define MTU_MC6_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006161Au)

/** \brief 660, Read Data and Bit Flip Register 0 */
#define MTU_MC6_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061660u)

/** \brief 662, Read Data and Bit Flip Register 1 */
#define MTU_MC6_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061662u)

/** \brief 664, Read Data and Bit Flip Register 2 */
#define MTU_MC6_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061664u)

/** \brief 666, Read Data and Bit Flip Register 3 */
#define MTU_MC6_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061666u)

