xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxMtu_reg.h
/** \brief 6BC, Read Data and Bit Flip Register 46 */
#define MTU_MC6_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616BCu)

/** \brief 6BE, Read Data and Bit Flip Register 47 */
#define MTU_MC6_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616BEu)

/** \brief 6C0, Read Data and Bit Flip Register 48 */
#define MTU_MC6_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616C0u)

/** \brief 6C2, Read Data and Bit Flip Register 49 */
#define MTU_MC6_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616C2u)

/** \brief 6C4, Read Data and Bit Flip Register 50 */
#define MTU_MC6_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616C4u)

/** \brief 6C6, Read Data and Bit Flip Register 51 */
#define MTU_MC6_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616C6u)

/** \brief 6C8, Read Data and Bit Flip Register 52 */
#define MTU_MC6_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616C8u)

/** \brief 6CA, Read Data and Bit Flip Register 53 */
#define MTU_MC6_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616CAu)

/** \brief 6CC, Read Data and Bit Flip Register 54 */
#define MTU_MC6_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616CCu)

/** \brief 6CE, Read Data and Bit Flip Register 55 */
#define MTU_MC6_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616CEu)

/** \brief 6D0, Read Data and Bit Flip Register 56 */
#define MTU_MC6_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616D0u)

/** \brief 6D2, Read Data and Bit Flip Register 57 */
#define MTU_MC6_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616D2u)

/** \brief 6D4, Read Data and Bit Flip Register 58 */
#define MTU_MC6_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616D4u)

/** \brief 6D6, Read Data and Bit Flip Register 59 */
#define MTU_MC6_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616D6u)

/** \brief 6D8, Read Data and Bit Flip Register 60 */
#define MTU_MC6_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616D8u)

/** \brief 6DA, Read Data and Bit Flip Register 61 */
#define MTU_MC6_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616DAu)

/** \brief 6DC, Read Data and Bit Flip Register 62 */
#define MTU_MC6_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616DCu)

/** \brief 6DE, Read Data and Bit Flip Register 63 */
#define MTU_MC6_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616DEu)

/** \brief 6E0, Read Data and Bit Flip Register 64 */
#define MTU_MC6_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616E0u)

/** \brief 6E2, Read Data and Bit Flip Register 65 */
#define MTU_MC6_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616E2u)

/** \brief 6E4, Read Data and Bit Flip Register 66 */
#define MTU_MC6_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616E4u)

/** \brief 6EE, Alarm Sources Configuration Register */
#define MTU_MC6_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00616EEu)

/** \brief 6F0, SSH Safety Faults Status Register  */
#define MTU_MC6_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00616F0u)

/** \brief 6F2, Error Information Register 0 */
#define MTU_MC6_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00616F2u)

/** \brief 6F4, Error Information Register 1 */
#define MTU_MC6_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00616F4u)

/** \brief 6F6, Error Information Register 2 */
#define MTU_MC6_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00616F6u)

/** \brief 6F8, Error Information Register 3 */
#define MTU_MC6_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00616F8u)

/** \brief 6FA, Error Information Register 4 */
#define MTU_MC6_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00616FAu)

/** \brief 700, Configuration Registers */
#define MTU_MC7_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061700u)

/** \brief 702, Configuration Register 1 */
#define MTU_MC7_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061702u)

/** \brief 704, MBIST Control Register */
#define MTU_MC7_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061704u)

/** \brief 706, Status Register */
#define MTU_MC7_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061706u)

/** \brief 708, Range Register, single address mode */
#define MTU_MC7_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061708u)

/** \brief 70C, Revision ID Register */
#define MTU_MC7_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006170Cu)

/** \brief 70E, ECC Safety Register */
#define MTU_MC7_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006170Eu)

/** \brief 710, Memory ECC Detection Register */
#define MTU_MC7_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061710u)

/** \brief 712, Error Tracking Register 0 */
#define MTU_MC7_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061712u)

/** \brief 714, Error Tracking Register 1 */
#define MTU_MC7_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061714u)

/** \brief 716, Error Tracking Register 2 */
#define MTU_MC7_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061716u)

/** \brief 718, Error Tracking Register 3 */
#define MTU_MC7_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061718u)

/** \brief 71A, Error Tracking Register 4 */
#define MTU_MC7_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006171Au)

/** \brief 760, Read Data and Bit Flip Register 0 */
#define MTU_MC7_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061760u)

/** \brief 762, Read Data and Bit Flip Register 1 */
#define MTU_MC7_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061762u)

/** \brief 764, Read Data and Bit Flip Register 2 */
#define MTU_MC7_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061764u)

