xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxMtu_reg.h
/** \brief 16F2, Error Information Register 0 */
#define MTU_MC22_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00626F2u)

/** \brief 16F4, Error Information Register 1 */
#define MTU_MC22_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00626F4u)

/** \brief 16F6, Error Information Register 2 */
#define MTU_MC22_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00626F6u)

/** \brief 16F8, Error Information Register 3 */
#define MTU_MC22_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00626F8u)

/** \brief 16FA, Error Information Register 4 */
#define MTU_MC22_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00626FAu)

/** \brief 1700, Configuration Registers */
#define MTU_MC23_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062700u)

/** \brief 1702, Configuration Register 1 */
#define MTU_MC23_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062702u)

/** \brief 1704, MBIST Control Register */
#define MTU_MC23_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062704u)

/** \brief 1706, Status Register */
#define MTU_MC23_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062706u)

/** \brief 1708, Range Register, single address mode */
#define MTU_MC23_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062708u)

/** \brief 170C, Revision ID Register */
#define MTU_MC23_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006270Cu)

/** \brief 170E, ECC Safety Register */
#define MTU_MC23_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006270Eu)

/** \brief 1710, Memory ECC Detection Register */
#define MTU_MC23_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062710u)

/** \brief 1712, Error Tracking Register 0 */
#define MTU_MC23_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062712u)

/** \brief 1714, Error Tracking Register 1 */
#define MTU_MC23_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062714u)

/** \brief 1716, Error Tracking Register 2 */
#define MTU_MC23_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062716u)

/** \brief 1718, Error Tracking Register 3 */
#define MTU_MC23_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062718u)

/** \brief 171A, Error Tracking Register 4 */
#define MTU_MC23_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006271Au)

/** \brief 1760, Read Data and Bit Flip Register 0 */
#define MTU_MC23_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062760u)

/** \brief 1762, Read Data and Bit Flip Register 1 */
#define MTU_MC23_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062762u)

/** \brief 1764, Read Data and Bit Flip Register 2 */
#define MTU_MC23_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062764u)

/** \brief 1766, Read Data and Bit Flip Register 3 */
#define MTU_MC23_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062766u)

/** \brief 1768, Read Data and Bit Flip Register 4 */
#define MTU_MC23_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062768u)

/** \brief 176A, Read Data and Bit Flip Register 5 */
#define MTU_MC23_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006276Au)

/** \brief 176C, Read Data and Bit Flip Register 6 */
#define MTU_MC23_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006276Cu)

/** \brief 176E, Read Data and Bit Flip Register 7 */
#define MTU_MC23_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006276Eu)

/** \brief 1770, Read Data and Bit Flip Register 8 */
#define MTU_MC23_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062770u)

/** \brief 1772, Read Data and Bit Flip Register 9 */
#define MTU_MC23_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062772u)

/** \brief 1774, Read Data and Bit Flip Register 10 */
#define MTU_MC23_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062774u)

/** \brief 1776, Read Data and Bit Flip Register 11 */
#define MTU_MC23_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062776u)

/** \brief 1778, Read Data and Bit Flip Register 12 */
#define MTU_MC23_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062778u)

/** \brief 177A, Read Data and Bit Flip Register 13 */
#define MTU_MC23_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006277Au)

/** \brief 177C, Read Data and Bit Flip Register 14 */
#define MTU_MC23_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006277Cu)

/** \brief 177E, Read Data and Bit Flip Register 15 */
#define MTU_MC23_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006277Eu)

/** \brief 1780, Read Data and Bit Flip Register 16 */
#define MTU_MC23_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062780u)

/** \brief 1782, Read Data and Bit Flip Register 17 */
#define MTU_MC23_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062782u)

/** \brief 1784, Read Data and Bit Flip Register 18 */
#define MTU_MC23_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062784u)

/** \brief 1786, Read Data and Bit Flip Register 19 */
#define MTU_MC23_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062786u)

/** \brief 1788, Read Data and Bit Flip Register 20 */
#define MTU_MC23_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062788u)

/** \brief 178A, Read Data and Bit Flip Register 21 */
#define MTU_MC23_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006278Au)

/** \brief 178C, Read Data and Bit Flip Register 22 */
#define MTU_MC23_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006278Cu)

/** \brief 178E, Read Data and Bit Flip Register 23 */
#define MTU_MC23_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006278Eu)

/** \brief 1790, Read Data and Bit Flip Register 24 */
#define MTU_MC23_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062790u)

/** \brief 1792, Read Data and Bit Flip Register 25 */
#define MTU_MC23_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062792u)

/** \brief 1794, Read Data and Bit Flip Register 26 */
#define MTU_MC23_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062794u)

/** \brief 1796, Read Data and Bit Flip Register 27 */
#define MTU_MC23_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062796u)

/** \brief 1798, Read Data and Bit Flip Register 28 */
#define MTU_MC23_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062798u)

/** \brief 179A, Read Data and Bit Flip Register 29 */
#define MTU_MC23_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006279Au)

/** \brief 179C, Read Data and Bit Flip Register 30 */
#define MTU_MC23_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006279Cu)

/** \brief 179E, Read Data and Bit Flip Register 31 */
#define MTU_MC23_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006279Eu)

