xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxMtu_reg.h
/** \brief 2BCC, Read Data and Bit Flip Register 54 */
#define MTU_MC43_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BCCu)

/** \brief 2BCE, Read Data and Bit Flip Register 55 */
#define MTU_MC43_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BCEu)

/** \brief 2BD0, Read Data and Bit Flip Register 56 */
#define MTU_MC43_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BD0u)

/** \brief 2BD2, Read Data and Bit Flip Register 57 */
#define MTU_MC43_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BD2u)

/** \brief 2BD4, Read Data and Bit Flip Register 58 */
#define MTU_MC43_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BD4u)

/** \brief 2BD6, Read Data and Bit Flip Register 59 */
#define MTU_MC43_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BD6u)

/** \brief 2BD8, Read Data and Bit Flip Register 60 */
#define MTU_MC43_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BD8u)

/** \brief 2BDA, Read Data and Bit Flip Register 61 */
#define MTU_MC43_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BDAu)

/** \brief 2BDC, Read Data and Bit Flip Register 62 */
#define MTU_MC43_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BDCu)

/** \brief 2BDE, Read Data and Bit Flip Register 63 */
#define MTU_MC43_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BDEu)

/** \brief 2BE0, Read Data and Bit Flip Register 64 */
#define MTU_MC43_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BE0u)

/** \brief 2BE2, Read Data and Bit Flip Register 65 */
#define MTU_MC43_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BE2u)

/** \brief 2BE4, Read Data and Bit Flip Register 66 */
#define MTU_MC43_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063BE4u)

/** \brief 2BEE, Alarm Sources Configuration Register */
#define MTU_MC43_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0063BEEu)

/** \brief 2BF0, SSH Safety Faults Status Register  */
#define MTU_MC43_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0063BF0u)

/** \brief 2BF2, Error Information Register 0 */
#define MTU_MC43_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063BF2u)

/** \brief 2BF4, Error Information Register 1 */
#define MTU_MC43_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063BF4u)

/** \brief 2BF6, Error Information Register 2 */
#define MTU_MC43_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063BF6u)

/** \brief 2BF8, Error Information Register 3 */
#define MTU_MC43_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063BF8u)

/** \brief 2BFA, Error Information Register 4 */
#define MTU_MC43_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063BFAu)

/** \brief 2C00, Configuration Registers */
#define MTU_MC44_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063C00u)

/** \brief 2C02, Configuration Register 1 */
#define MTU_MC44_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063C02u)

/** \brief 2C04, MBIST Control Register */
#define MTU_MC44_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063C04u)

/** \brief 2C06, Status Register */
#define MTU_MC44_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063C06u)

/** \brief 2C08, Range Register, single address mode */
#define MTU_MC44_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063C08u)

/** \brief 2C0C, Revision ID Register */
#define MTU_MC44_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0063C0Cu)

/** \brief 2C0E, ECC Safety Register */
#define MTU_MC44_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0063C0Eu)

/** \brief 2C10, Memory ECC Detection Register */
#define MTU_MC44_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063C10u)

/** \brief 2C12, Error Tracking Register 0 */
#define MTU_MC44_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063C12u)

/** \brief 2C14, Error Tracking Register 1 */
#define MTU_MC44_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063C14u)

/** \brief 2C16, Error Tracking Register 2 */
#define MTU_MC44_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063C16u)

/** \brief 2C18, Error Tracking Register 3 */
#define MTU_MC44_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063C18u)

/** \brief 2C1A, Error Tracking Register 4 */
#define MTU_MC44_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063C1Au)

/** \brief 2C60, Read Data and Bit Flip Register 0 */
#define MTU_MC44_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C60u)

/** \brief 2C62, Read Data and Bit Flip Register 1 */
#define MTU_MC44_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C62u)

/** \brief 2C64, Read Data and Bit Flip Register 2 */
#define MTU_MC44_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C64u)

/** \brief 2C66, Read Data and Bit Flip Register 3 */
#define MTU_MC44_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C66u)

/** \brief 2C68, Read Data and Bit Flip Register 4 */
#define MTU_MC44_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C68u)

/** \brief 2C6A, Read Data and Bit Flip Register 5 */
#define MTU_MC44_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C6Au)

/** \brief 2C6C, Read Data and Bit Flip Register 6 */
#define MTU_MC44_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C6Cu)

/** \brief 2C6E, Read Data and Bit Flip Register 7 */
#define MTU_MC44_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C6Eu)

/** \brief 2C70, Read Data and Bit Flip Register 8 */
#define MTU_MC44_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C70u)

/** \brief 2C72, Read Data and Bit Flip Register 9 */
#define MTU_MC44_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C72u)

