xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxMtu_reg.h
/** \brief 3A66, Read Data and Bit Flip Register 3 */
#define MTU_MC58_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A66u)

/** \brief 3A68, Read Data and Bit Flip Register 4 */
#define MTU_MC58_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A68u)

/** \brief 3A6A, Read Data and Bit Flip Register 5 */
#define MTU_MC58_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A6Au)

/** \brief 3A6C, Read Data and Bit Flip Register 6 */
#define MTU_MC58_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A6Cu)

/** \brief 3A6E, Read Data and Bit Flip Register 7 */
#define MTU_MC58_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A6Eu)

/** \brief 3A70, Read Data and Bit Flip Register 8 */
#define MTU_MC58_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A70u)

/** \brief 3A72, Read Data and Bit Flip Register 9 */
#define MTU_MC58_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A72u)

/** \brief 3A74, Read Data and Bit Flip Register 10 */
#define MTU_MC58_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A74u)

/** \brief 3A76, Read Data and Bit Flip Register 11 */
#define MTU_MC58_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A76u)

/** \brief 3A78, Read Data and Bit Flip Register 12 */
#define MTU_MC58_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A78u)

/** \brief 3A7A, Read Data and Bit Flip Register 13 */
#define MTU_MC58_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A7Au)

/** \brief 3A7C, Read Data and Bit Flip Register 14 */
#define MTU_MC58_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A7Cu)

/** \brief 3A7E, Read Data and Bit Flip Register 15 */
#define MTU_MC58_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A7Eu)

/** \brief 3A80, Read Data and Bit Flip Register 16 */
#define MTU_MC58_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A80u)

/** \brief 3A82, Read Data and Bit Flip Register 17 */
#define MTU_MC58_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A82u)

/** \brief 3A84, Read Data and Bit Flip Register 18 */
#define MTU_MC58_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A84u)

/** \brief 3A86, Read Data and Bit Flip Register 19 */
#define MTU_MC58_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A86u)

/** \brief 3A88, Read Data and Bit Flip Register 20 */
#define MTU_MC58_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A88u)

/** \brief 3A8A, Read Data and Bit Flip Register 21 */
#define MTU_MC58_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A8Au)

/** \brief 3A8C, Read Data and Bit Flip Register 22 */
#define MTU_MC58_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A8Cu)

/** \brief 3A8E, Read Data and Bit Flip Register 23 */
#define MTU_MC58_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A8Eu)

/** \brief 3A90, Read Data and Bit Flip Register 24 */
#define MTU_MC58_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A90u)

/** \brief 3A92, Read Data and Bit Flip Register 25 */
#define MTU_MC58_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A92u)

/** \brief 3A94, Read Data and Bit Flip Register 26 */
#define MTU_MC58_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A94u)

/** \brief 3A96, Read Data and Bit Flip Register 27 */
#define MTU_MC58_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A96u)

/** \brief 3A98, Read Data and Bit Flip Register 28 */
#define MTU_MC58_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A98u)

/** \brief 3A9A, Read Data and Bit Flip Register 29 */
#define MTU_MC58_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A9Au)

/** \brief 3A9C, Read Data and Bit Flip Register 30 */
#define MTU_MC58_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A9Cu)

/** \brief 3A9E, Read Data and Bit Flip Register 31 */
#define MTU_MC58_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064A9Eu)

/** \brief 3AA0, Read Data and Bit Flip Register 32 */
#define MTU_MC58_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AA0u)

/** \brief 3AA2, Read Data and Bit Flip Register 33 */
#define MTU_MC58_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AA2u)

/** \brief 3AA4, Read Data and Bit Flip Register 34 */
#define MTU_MC58_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AA4u)

/** \brief 3AA6, Read Data and Bit Flip Register 35 */
#define MTU_MC58_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AA6u)

/** \brief 3AA8, Read Data and Bit Flip Register 36 */
#define MTU_MC58_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AA8u)

/** \brief 3AAA, Read Data and Bit Flip Register 37 */
#define MTU_MC58_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AAAu)

/** \brief 3AAC, Read Data and Bit Flip Register 38 */
#define MTU_MC58_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AACu)

/** \brief 3AAE, Read Data and Bit Flip Register 39 */
#define MTU_MC58_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AAEu)

/** \brief 3AB0, Read Data and Bit Flip Register 40 */
#define MTU_MC58_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AB0u)

/** \brief 3AB2, Read Data and Bit Flip Register 41 */
#define MTU_MC58_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AB2u)

/** \brief 3AB4, Read Data and Bit Flip Register 42 */
#define MTU_MC58_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AB4u)

/** \brief 3AB6, Read Data and Bit Flip Register 43 */
#define MTU_MC58_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AB6u)

/** \brief 3AB8, Read Data and Bit Flip Register 44 */
#define MTU_MC58_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AB8u)

/** \brief 3ABA, Read Data and Bit Flip Register 45 */
#define MTU_MC58_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ABAu)

/** \brief 3ABC, Read Data and Bit Flip Register 46 */
#define MTU_MC58_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ABCu)

/** \brief 3ABE, Read Data and Bit Flip Register 47 */
#define MTU_MC58_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ABEu)

/** \brief 3AC0, Read Data and Bit Flip Register 48 */
#define MTU_MC58_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AC0u)

/** \brief 3AC2, Read Data and Bit Flip Register 49 */
#define MTU_MC58_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AC2u)

/** \brief 3AC4, Read Data and Bit Flip Register 50 */
#define MTU_MC58_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AC4u)

/** \brief 3AC6, Read Data and Bit Flip Register 51 */
#define MTU_MC58_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AC6u)

/** \brief 3AC8, Read Data and Bit Flip Register 52 */
#define MTU_MC58_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AC8u)

/** \brief 3ACA, Read Data and Bit Flip Register 53 */
#define MTU_MC58_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ACAu)

