xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxMtu_reg.h
/** \brief 3CCE, Read Data and Bit Flip Register 55 */
#define MTU_MC60_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CCEu)

/** \brief 3CD0, Read Data and Bit Flip Register 56 */
#define MTU_MC60_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CD0u)

/** \brief 3CD2, Read Data and Bit Flip Register 57 */
#define MTU_MC60_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CD2u)

/** \brief 3CD4, Read Data and Bit Flip Register 58 */
#define MTU_MC60_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CD4u)

/** \brief 3CD6, Read Data and Bit Flip Register 59 */
#define MTU_MC60_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CD6u)

/** \brief 3CD8, Read Data and Bit Flip Register 60 */
#define MTU_MC60_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CD8u)

/** \brief 3CDA, Read Data and Bit Flip Register 61 */
#define MTU_MC60_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CDAu)

/** \brief 3CDC, Read Data and Bit Flip Register 62 */
#define MTU_MC60_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CDCu)

/** \brief 3CDE, Read Data and Bit Flip Register 63 */
#define MTU_MC60_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CDEu)

/** \brief 3CE0, Read Data and Bit Flip Register 64 */
#define MTU_MC60_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CE0u)

/** \brief 3CE2, Read Data and Bit Flip Register 65 */
#define MTU_MC60_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CE2u)

/** \brief 3CE4, Read Data and Bit Flip Register 66 */
#define MTU_MC60_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064CE4u)

/** \brief 3CEE, Alarm Sources Configuration Register */
#define MTU_MC60_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0064CEEu)

/** \brief 3CF0, SSH Safety Faults Status Register  */
#define MTU_MC60_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0064CF0u)

/** \brief 3CF2, Error Information Register 0 */
#define MTU_MC60_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064CF2u)

/** \brief 3CF4, Error Information Register 1 */
#define MTU_MC60_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064CF4u)

/** \brief 3CF6, Error Information Register 2 */
#define MTU_MC60_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064CF6u)

/** \brief 3CF8, Error Information Register 3 */
#define MTU_MC60_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064CF8u)

/** \brief 3CFA, Error Information Register 4 */
#define MTU_MC60_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064CFAu)

/** \brief 3D00, Configuration Registers */
#define MTU_MC61_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064D00u)

/** \brief 3D02, Configuration Register 1 */
#define MTU_MC61_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064D02u)

/** \brief 3D04, MBIST Control Register */
#define MTU_MC61_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064D04u)

/** \brief 3D06, Status Register */
#define MTU_MC61_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064D06u)

/** \brief 3D08, Range Register, single address mode */
#define MTU_MC61_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064D08u)

/** \brief 3D0C, Revision ID Register */
#define MTU_MC61_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0064D0Cu)

/** \brief 3D0E, ECC Safety Register */
#define MTU_MC61_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0064D0Eu)

/** \brief 3D10, Memory ECC Detection Register */
#define MTU_MC61_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064D10u)

/** \brief 3D12, Error Tracking Register 0 */
#define MTU_MC61_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064D12u)

/** \brief 3D14, Error Tracking Register 1 */
#define MTU_MC61_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064D14u)

/** \brief 3D16, Error Tracking Register 2 */
#define MTU_MC61_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064D16u)

/** \brief 3D18, Error Tracking Register 3 */
#define MTU_MC61_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064D18u)

/** \brief 3D1A, Error Tracking Register 4 */
#define MTU_MC61_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064D1Au)

/** \brief 3D60, Read Data and Bit Flip Register 0 */
#define MTU_MC61_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D60u)

/** \brief 3D62, Read Data and Bit Flip Register 1 */
#define MTU_MC61_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D62u)

/** \brief 3D64, Read Data and Bit Flip Register 2 */
#define MTU_MC61_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D64u)

/** \brief 3D66, Read Data and Bit Flip Register 3 */
#define MTU_MC61_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D66u)

/** \brief 3D68, Read Data and Bit Flip Register 4 */
#define MTU_MC61_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D68u)

/** \brief 3D6A, Read Data and Bit Flip Register 5 */
#define MTU_MC61_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D6Au)

/** \brief 3D6C, Read Data and Bit Flip Register 6 */
#define MTU_MC61_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D6Cu)

/** \brief 3D6E, Read Data and Bit Flip Register 7 */
#define MTU_MC61_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D6Eu)

/** \brief 3D70, Read Data and Bit Flip Register 8 */
#define MTU_MC61_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D70u)

/** \brief 3D72, Read Data and Bit Flip Register 9 */
#define MTU_MC61_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D72u)

/** \brief 3D74, Read Data and Bit Flip Register 10 */
#define MTU_MC61_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D74u)

/** \brief 3D76, Read Data and Bit Flip Register 11 */
#define MTU_MC61_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064D76u)

