xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxMtu_reg.h
/** \brief 4076, Read Data and Bit Flip Register 11 */
#define MTU_MC64_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065076u)

/** \brief 4078, Read Data and Bit Flip Register 12 */
#define MTU_MC64_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065078u)

/** \brief 407A, Read Data and Bit Flip Register 13 */
#define MTU_MC64_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006507Au)

/** \brief 407C, Read Data and Bit Flip Register 14 */
#define MTU_MC64_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006507Cu)

/** \brief 407E, Read Data and Bit Flip Register 15 */
#define MTU_MC64_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006507Eu)

/** \brief 4080, Read Data and Bit Flip Register 16 */
#define MTU_MC64_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065080u)

/** \brief 4082, Read Data and Bit Flip Register 17 */
#define MTU_MC64_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065082u)

/** \brief 4084, Read Data and Bit Flip Register 18 */
#define MTU_MC64_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065084u)

/** \brief 4086, Read Data and Bit Flip Register 19 */
#define MTU_MC64_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065086u)

/** \brief 4088, Read Data and Bit Flip Register 20 */
#define MTU_MC64_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065088u)

/** \brief 408A, Read Data and Bit Flip Register 21 */
#define MTU_MC64_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006508Au)

/** \brief 408C, Read Data and Bit Flip Register 22 */
#define MTU_MC64_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006508Cu)

/** \brief 408E, Read Data and Bit Flip Register 23 */
#define MTU_MC64_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006508Eu)

/** \brief 4090, Read Data and Bit Flip Register 24 */
#define MTU_MC64_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065090u)

/** \brief 4092, Read Data and Bit Flip Register 25 */
#define MTU_MC64_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065092u)

/** \brief 4094, Read Data and Bit Flip Register 26 */
#define MTU_MC64_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065094u)

/** \brief 4096, Read Data and Bit Flip Register 27 */
#define MTU_MC64_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065096u)

/** \brief 4098, Read Data and Bit Flip Register 28 */
#define MTU_MC64_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065098u)

/** \brief 409A, Read Data and Bit Flip Register 29 */
#define MTU_MC64_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006509Au)

/** \brief 409C, Read Data and Bit Flip Register 30 */
#define MTU_MC64_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006509Cu)

/** \brief 409E, Read Data and Bit Flip Register 31 */
#define MTU_MC64_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006509Eu)

/** \brief 40A0, Read Data and Bit Flip Register 32 */
#define MTU_MC64_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650A0u)

/** \brief 40A2, Read Data and Bit Flip Register 33 */
#define MTU_MC64_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650A2u)

/** \brief 40A4, Read Data and Bit Flip Register 34 */
#define MTU_MC64_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650A4u)

/** \brief 40A6, Read Data and Bit Flip Register 35 */
#define MTU_MC64_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650A6u)

/** \brief 40A8, Read Data and Bit Flip Register 36 */
#define MTU_MC64_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650A8u)

/** \brief 40AA, Read Data and Bit Flip Register 37 */
#define MTU_MC64_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650AAu)

/** \brief 40AC, Read Data and Bit Flip Register 38 */
#define MTU_MC64_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650ACu)

/** \brief 40AE, Read Data and Bit Flip Register 39 */
#define MTU_MC64_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650AEu)

/** \brief 40B0, Read Data and Bit Flip Register 40 */
#define MTU_MC64_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650B0u)

/** \brief 40B2, Read Data and Bit Flip Register 41 */
#define MTU_MC64_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650B2u)

/** \brief 40B4, Read Data and Bit Flip Register 42 */
#define MTU_MC64_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650B4u)

/** \brief 40B6, Read Data and Bit Flip Register 43 */
#define MTU_MC64_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650B6u)

/** \brief 40B8, Read Data and Bit Flip Register 44 */
#define MTU_MC64_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650B8u)

/** \brief 40BA, Read Data and Bit Flip Register 45 */
#define MTU_MC64_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650BAu)

/** \brief 40BC, Read Data and Bit Flip Register 46 */
#define MTU_MC64_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650BCu)

/** \brief 40BE, Read Data and Bit Flip Register 47 */
#define MTU_MC64_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650BEu)

/** \brief 40C0, Read Data and Bit Flip Register 48 */
#define MTU_MC64_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650C0u)

/** \brief 40C2, Read Data and Bit Flip Register 49 */
#define MTU_MC64_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650C2u)

/** \brief 40C4, Read Data and Bit Flip Register 50 */
#define MTU_MC64_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650C4u)

/** \brief 40C6, Read Data and Bit Flip Register 51 */
#define MTU_MC64_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650C6u)

/** \brief 40C8, Read Data and Bit Flip Register 52 */
#define MTU_MC64_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650C8u)

/** \brief 40CA, Read Data and Bit Flip Register 53 */
#define MTU_MC64_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00650CAu)

