xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxMtu_reg.h
/** \brief 56CE, Read Data and Bit Flip Register 55 */
#define MTU_MC86_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666CEu)

/** \brief 56D0, Read Data and Bit Flip Register 56 */
#define MTU_MC86_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666D0u)

/** \brief 56D2, Read Data and Bit Flip Register 57 */
#define MTU_MC86_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666D2u)

/** \brief 56D4, Read Data and Bit Flip Register 58 */
#define MTU_MC86_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666D4u)

/** \brief 56D6, Read Data and Bit Flip Register 59 */
#define MTU_MC86_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666D6u)

/** \brief 56D8, Read Data and Bit Flip Register 60 */
#define MTU_MC86_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666D8u)

/** \brief 56DA, Read Data and Bit Flip Register 61 */
#define MTU_MC86_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666DAu)

/** \brief 56DC, Read Data and Bit Flip Register 62 */
#define MTU_MC86_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666DCu)

/** \brief 56DE, Read Data and Bit Flip Register 63 */
#define MTU_MC86_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666DEu)

/** \brief 56E0, Read Data and Bit Flip Register 64 */
#define MTU_MC86_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666E0u)

/** \brief 56E2, Read Data and Bit Flip Register 65 */
#define MTU_MC86_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666E2u)

/** \brief 56E4, Read Data and Bit Flip Register 66 */
#define MTU_MC86_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666E4u)

/** \brief 56EE, Alarm Sources Configuration Register */
#define MTU_MC86_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00666EEu)

/** \brief 56F0, SSH Safety Faults Status Register  */
#define MTU_MC86_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00666F0u)

/** \brief 56F2, Error Information Register 0 */
#define MTU_MC86_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00666F2u)

/** \brief 56F4, Error Information Register 1 */
#define MTU_MC86_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00666F4u)

/** \brief 56F6, Error Information Register 2 */
#define MTU_MC86_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00666F6u)

/** \brief 56F8, Error Information Register 3 */
#define MTU_MC86_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00666F8u)

/** \brief 56FA, Error Information Register 4 */
#define MTU_MC86_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00666FAu)

/** \brief 5700, Configuration Registers */
#define MTU_MC87_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066700u)

/** \brief 5702, Configuration Register 1 */
#define MTU_MC87_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066702u)

/** \brief 5704, MBIST Control Register */
#define MTU_MC87_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066704u)

/** \brief 5706, Status Register */
#define MTU_MC87_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066706u)

/** \brief 5708, Range Register, single address mode */
#define MTU_MC87_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066708u)

/** \brief 570C, Revision ID Register */
#define MTU_MC87_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006670Cu)

/** \brief 570E, ECC Safety Register */
#define MTU_MC87_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006670Eu)

/** \brief 5710, Memory ECC Detection Register */
#define MTU_MC87_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066710u)

/** \brief 5712, Error Tracking Register 0 */
#define MTU_MC87_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066712u)

/** \brief 5714, Error Tracking Register 1 */
#define MTU_MC87_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066714u)

/** \brief 5716, Error Tracking Register 2 */
#define MTU_MC87_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066716u)

/** \brief 5718, Error Tracking Register 3 */
#define MTU_MC87_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066718u)

/** \brief 571A, Error Tracking Register 4 */
#define MTU_MC87_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006671Au)

/** \brief 5760, Read Data and Bit Flip Register 0 */
#define MTU_MC87_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066760u)

/** \brief 5762, Read Data and Bit Flip Register 1 */
#define MTU_MC87_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066762u)

/** \brief 5764, Read Data and Bit Flip Register 2 */
#define MTU_MC87_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066764u)

/** \brief 5766, Read Data and Bit Flip Register 3 */
#define MTU_MC87_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066766u)

/** \brief 5768, Read Data and Bit Flip Register 4 */
#define MTU_MC87_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066768u)

/** \brief 576A, Read Data and Bit Flip Register 5 */
#define MTU_MC87_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006676Au)

/** \brief 576C, Read Data and Bit Flip Register 6 */
#define MTU_MC87_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006676Cu)

/** \brief 576E, Read Data and Bit Flip Register 7 */
#define MTU_MC87_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006676Eu)

/** \brief 5770, Read Data and Bit Flip Register 8 */
#define MTU_MC87_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066770u)

/** \brief 5772, Read Data and Bit Flip Register 9 */
#define MTU_MC87_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066772u)

/** \brief 5774, Read Data and Bit Flip Register 10 */
#define MTU_MC87_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066774u)

/** \brief 5776, Read Data and Bit Flip Register 11 */
#define MTU_MC87_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066776u)

/** \brief 5778, Read Data and Bit Flip Register 12 */
#define MTU_MC87_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066778u)

/** \brief 577A, Read Data and Bit Flip Register 13 */
#define MTU_MC87_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006677Au)

