xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxMtu_reg.h
/** \brief 5900, Configuration Registers */
#define MTU_MC89_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066900u)

/** \brief 5902, Configuration Register 1 */
#define MTU_MC89_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066902u)

/** \brief 5904, MBIST Control Register */
#define MTU_MC89_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066904u)

/** \brief 5906, Status Register */
#define MTU_MC89_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066906u)

/** \brief 5908, Range Register, single address mode */
#define MTU_MC89_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066908u)

/** \brief 590C, Revision ID Register */
#define MTU_MC89_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006690Cu)

/** \brief 590E, ECC Safety Register */
#define MTU_MC89_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006690Eu)

/** \brief 5910, Memory ECC Detection Register */
#define MTU_MC89_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066910u)

/** \brief 5912, Error Tracking Register 0 */
#define MTU_MC89_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066912u)

/** \brief 5914, Error Tracking Register 1 */
#define MTU_MC89_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066914u)

/** \brief 5916, Error Tracking Register 2 */
#define MTU_MC89_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066916u)

/** \brief 5918, Error Tracking Register 3 */
#define MTU_MC89_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066918u)

/** \brief 591A, Error Tracking Register 4 */
#define MTU_MC89_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006691Au)

/** \brief 5960, Read Data and Bit Flip Register 0 */
#define MTU_MC89_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066960u)

/** \brief 5962, Read Data and Bit Flip Register 1 */
#define MTU_MC89_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066962u)

/** \brief 5964, Read Data and Bit Flip Register 2 */
#define MTU_MC89_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066964u)

/** \brief 5966, Read Data and Bit Flip Register 3 */
#define MTU_MC89_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066966u)

/** \brief 5968, Read Data and Bit Flip Register 4 */
#define MTU_MC89_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066968u)

/** \brief 596A, Read Data and Bit Flip Register 5 */
#define MTU_MC89_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006696Au)

/** \brief 596C, Read Data and Bit Flip Register 6 */
#define MTU_MC89_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006696Cu)

/** \brief 596E, Read Data and Bit Flip Register 7 */
#define MTU_MC89_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006696Eu)

/** \brief 5970, Read Data and Bit Flip Register 8 */
#define MTU_MC89_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066970u)

/** \brief 5972, Read Data and Bit Flip Register 9 */
#define MTU_MC89_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066972u)

/** \brief 5974, Read Data and Bit Flip Register 10 */
#define MTU_MC89_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066974u)

/** \brief 5976, Read Data and Bit Flip Register 11 */
#define MTU_MC89_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066976u)

/** \brief 5978, Read Data and Bit Flip Register 12 */
#define MTU_MC89_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066978u)

/** \brief 597A, Read Data and Bit Flip Register 13 */
#define MTU_MC89_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006697Au)

/** \brief 597C, Read Data and Bit Flip Register 14 */
#define MTU_MC89_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006697Cu)

/** \brief 597E, Read Data and Bit Flip Register 15 */
#define MTU_MC89_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006697Eu)

/** \brief 5980, Read Data and Bit Flip Register 16 */
#define MTU_MC89_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066980u)

/** \brief 5982, Read Data and Bit Flip Register 17 */
#define MTU_MC89_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066982u)

/** \brief 5984, Read Data and Bit Flip Register 18 */
#define MTU_MC89_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066984u)

/** \brief 5986, Read Data and Bit Flip Register 19 */
#define MTU_MC89_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066986u)

/** \brief 5988, Read Data and Bit Flip Register 20 */
#define MTU_MC89_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066988u)

/** \brief 598A, Read Data and Bit Flip Register 21 */
#define MTU_MC89_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006698Au)

/** \brief 598C, Read Data and Bit Flip Register 22 */
#define MTU_MC89_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006698Cu)

/** \brief 598E, Read Data and Bit Flip Register 23 */
#define MTU_MC89_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006698Eu)

/** \brief 5990, Read Data and Bit Flip Register 24 */
#define MTU_MC89_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066990u)

/** \brief 5992, Read Data and Bit Flip Register 25 */
#define MTU_MC89_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066992u)

/** \brief 5994, Read Data and Bit Flip Register 26 */
#define MTU_MC89_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066994u)

/** \brief 5996, Read Data and Bit Flip Register 27 */
#define MTU_MC89_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066996u)

/** \brief 5998, Read Data and Bit Flip Register 28 */
#define MTU_MC89_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066998u)

/** \brief 599A, Read Data and Bit Flip Register 29 */
#define MTU_MC89_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006699Au)

/** \brief 599C, Read Data and Bit Flip Register 30 */
#define MTU_MC89_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006699Cu)

/** \brief 599E, Read Data and Bit Flip Register 31 */
#define MTU_MC89_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006699Eu)

