xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxMtu_reg.h
/** \brief 5FC6, Read Data and Bit Flip Register 51 */
#define MTU_MC95_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FC6u)

/** \brief 5FC8, Read Data and Bit Flip Register 52 */
#define MTU_MC95_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FC8u)

/** \brief 5FCA, Read Data and Bit Flip Register 53 */
#define MTU_MC95_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FCAu)

/** \brief 5FCC, Read Data and Bit Flip Register 54 */
#define MTU_MC95_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FCCu)

/** \brief 5FCE, Read Data and Bit Flip Register 55 */
#define MTU_MC95_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FCEu)

/** \brief 5FD0, Read Data and Bit Flip Register 56 */
#define MTU_MC95_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FD0u)

/** \brief 5FD2, Read Data and Bit Flip Register 57 */
#define MTU_MC95_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FD2u)

/** \brief 5FD4, Read Data and Bit Flip Register 58 */
#define MTU_MC95_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FD4u)

/** \brief 5FD6, Read Data and Bit Flip Register 59 */
#define MTU_MC95_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FD6u)

/** \brief 5FD8, Read Data and Bit Flip Register 60 */
#define MTU_MC95_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FD8u)

/** \brief 5FDA, Read Data and Bit Flip Register 61 */
#define MTU_MC95_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FDAu)

/** \brief 5FDC, Read Data and Bit Flip Register 62 */
#define MTU_MC95_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FDCu)

/** \brief 5FDE, Read Data and Bit Flip Register 63 */
#define MTU_MC95_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FDEu)

/** \brief 5FE0, Read Data and Bit Flip Register 64 */
#define MTU_MC95_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FE0u)

/** \brief 5FE2, Read Data and Bit Flip Register 65 */
#define MTU_MC95_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FE2u)

/** \brief 5FE4, Read Data and Bit Flip Register 66 */
#define MTU_MC95_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FE4u)

/** \brief 5FEE, Alarm Sources Configuration Register */
#define MTU_MC95_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0066FEEu)

/** \brief 5FF0, SSH Safety Faults Status Register  */
#define MTU_MC95_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0066FF0u)

/** \brief 5FF2, Error Information Register 0 */
#define MTU_MC95_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066FF2u)

/** \brief 5FF4, Error Information Register 1 */
#define MTU_MC95_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066FF4u)

/** \brief 5FF6, Error Information Register 2 */
#define MTU_MC95_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066FF6u)

/** \brief 5FF8, Error Information Register 3 */
#define MTU_MC95_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066FF8u)

/** \brief 5FFA, Error Information Register 4 */
#define MTU_MC95_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066FFAu)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXMTU_REG_H */
